# SetConstraints Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeSegment..::..SetConstraints Method
RebarShapeSegment Class See Also
---
Assign a new list of constraints to this segment.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetConstraints(
	IList<RebarShapeConstraint> constraints
)
```

Visual Basic
---
```text
Public Sub SetConstraints ( _
	constraints As IList(Of RebarShapeConstraint) _
)
```

Visual C++
---
```text
public:
void SetConstraints(
	IList<RebarShapeConstraint^>^ constraints
)
```

# ### Parameters
constraints
    Type: System.Collections.Generic..::..IList<(Of <(<'RebarShapeConstraint>)>)> A new list of constraints.
# Remarks
Any existing constraints are discarded. The new constraints replace them. Any parameters driving the constraints must already be added with RebarShapeDefinition.AddParameter().
The allowable constraint types are:
  * RebarShapeConstraintAngleFromFixedDir
  * RebarShapeConstraintSegmentLength
  * RebarShapeConstraintFixedSegmentDir
  * RebarShapeConstraintProjectedSegmentLength
  * RebarShapeConstraint180DegreeBendArcLength
  * RebarShapeConstraint180DegreeBendRadius
  * RebarShapeConstraint180DegreeDefaultBend

At least two independent constraints must be specified. Overconstraining is supported. Constraints of type RebarShapeConstraintFixedSegmentDir must be unique.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | One or more of the constraints is of a type not supported for RebarShapeSegment. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarShapeSegment Class
Autodesk.Revit.DB.Structure Namespace